'''
あなたはダンジョンの一本道を通ろうとしています。
しかし、その一本道にはダメージを受ける床があります。ダメージを受けても体力が0にならなければ通る事にしました。

現在の体力と、一本道の床の地図データが与えられます。
床のデータは 0 と 1 で構成された文字列で与えられ 1 はダメージ床を表します。

体力が1以上残る場合は一本道を通った後の体力、体力が 0 以下になる場合は No を出力するプログラムを作成してください。

---入力される値---
入力は標準入力にて以下のフォーマットで与えられます。

s
t


・1 行目は文字列で一本道の床の地図データが与えられます。 0 と 1 で構成された文字列で 1 はダメージ床を表します。
・2 行目は整数で現在の体力が与えられます。
・入力は 2 行となり、末尾に改行が 1 つ入ります。
条件
すべてのテストケースにおいて、以下の条件をみたします。

・1 ≦ 文字列 s の長さ ≦ 100
・1 ≦ t ≦ 100
・s は 0 と 1 で構成された文字列
・t は整数

---期待する出力---
体力が1以上残る場合は一本道を通った後の体力、体力が 0 以下になる場合は "No" を出力してください。

出力の最後に改行を入れ、余計な文字、空行を含んではいけません。

---入力例１---
入力
011100110111
10

出力
2

---入力例２---
入力
11110011010111011101111111010
20

出力
No
'''

#input_line1 = input()
#input_line2 = input()

input_line1 = '011100110111'
input_line2 = '10'

#input_line1 = '11110011010111011101111111010'
#input_line2 = '20'

hp_num = int(input_line2)
data_len = len(input_line1)
map_data = [0] * data_len
for i in range(data_len) :
    map_data[i] = int(input_line1[i])

    if map_data[i] == 1 :
        hp_num -= 1
    
    if hp_num <= 0 :
        print('No')
        break
    
    if i == (data_len-1) :
        print(hp_num)



